In [ ]:
# Understanding Your Data | 
# ------------------------------------------
#
# 1. Importance of Quality Data:
# - Quality data is the foundation of any successful data science project.
# - Proper sourcing and cleaning of data are essential to gain actionable insights.
# - Understanding the data helps avoid biases and errors in later modeling stages.
#
# 2. Considering Bias and Fairness:
# - Be cautious of potential harms caused by lack of representation in data.
# - Machine learning models can replicate societal biases if data is skewed.
# - Under-represented groups may lead to poor model performance and unfair outcomes.
# - Evaluate risks and apply mitigation techniques before deploying models.
#
# 3. Basic Questions to Ask When You Get Data:
# - How big is the dataset? (number of rows and columns)
# - What does the data look like? (using head, tail, and sample views)
# - What are the data types of columns? (categorical, numerical, etc.)
# - Are there missing values? (count and percentage per column)
# - How does the data look mathematically? (descriptive statistics: mean, median, std, quartiles)
# - Are there duplicate values? (check for redundancy that can mislead models)
# - How are columns correlated? (identify relationships among features)
#
# 4. Techniques and Tools:
# - Use pandas functions like .shape, .info(), .head(), .sample() to explore basic structure.
# - Use pandas .isnull().sum() to find missing data.
# - Use pandas .describe() for statistical summary of numerical columns.
# - Use .duplicated().sum() to count duplicate rows.
# - Use correlation functions (.corr()) to analyze feature relationships.
#
# 5. Practical Tips:
# - Always start exploration by asking these basic questions systematically.
# - Look at random samples to prevent biased assumptions about the dataset.
# - Identify columns that may need data cleaning or preprocessing early on.
# - Understand missing data patterns to decide on imputation or removal strategies.
# - Check for duplicates before modeling to improve accuracy.
# - Correlation analysis helps in feature selection and understanding data inter-dependencies.
#
# 6. Summary:
# - Understanding your dataset fully before modeling is crucial for success.
# - This foundational step saves time and improves the quality of machine learning solutions.
# - A structured approach to initial data exploration sets the stage for effective data science workflows.
#
# -- End of Notes --

In [5]:
import pandas as pd

In [6]:
df = pd.read_csv('train.csv')

# 1. How big is the data?

In [7]:
df.shape

(891, 12)

# 2. How does the data look like?

In [8]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
167,168,0,3,"Skoog, Mrs. William (Anna Bernhardina Karlsson)",female,45.0,1,4,347088,27.9000,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
638,639,0,3,"Panula, Mrs. Juha (Maria Emilia Ojala)",female,41.0,0,5,3101295,39.6875,NaN,S
400,401,1,3,"Niskanen, Mr. Juha",male,39.0,0,0,STON/O 2. 3101289,7.9250,NaN,S
291,292,1,1,"Bishop, Mrs. Dickinson H (Helen Walton)",female,19.0,1,0,11967,91.0792,B49,C

# 3. What is the data type of cols?

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# 4. Are there any missing values?

In [10]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# 5. How does the data look mathematically?

In [11]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# 6. Are there duplicate values?

In [12]:
df.duplicated().sum()

np.int64(0)

# 7. How is the correlation between cols?

In [13]:
# First, identify which columns are numerical and which are strings
# Let's select only the numerical columns for correlation
numeric_columns = df.select_dtypes(include=['int64', 'float64']).columns
df_numeric = df[numeric_columns]

# Now calculate correlation on numeric columns only
correlation_matrix = df_numeric.corr()

# Display the correlation matrix
correlation_matrix

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [17]:
print(df.dtypes)
# Then, either drop the string columns or convert them to numerical values
# Option 1: Drop string columns
numeric_df = df.select_dtypes(include=['float64', 'int64'])
print(numeric_df.corr()['Survived'])

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object
PassengerId   -0.005007
Survived       1.000000
Pclass        -0.338481
Age           -0.077221
SibSp         -0.035322
Parch          0.081629
Fare           0.257307
Name: Survived, dtype: float64